In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {'company': ['B', 'A', 'B', np.nan],
         'gender': ['female', 'female', 'male','male'],
         'age': [40, 31, 28,28]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

  company  gender  age
0       B  female   40
1       A  female   31
2       B    male   28
3     NaN    male   28

In [23]:
# value_counts
# 统计分类变量中每个类的数量
# normalize 返回各类的占比
#

In [8]:
df.gender.value_counts(normalize=True)

male      0.5
female    0.5
Name: gender, dtype: float64

In [32]:
# isna
# 判断DataFrame / Series 是否为缺失值，是的话返回True，否的话返回False

In [10]:
df.isna()

   company  gender    age
0    False   False  False
1    False   False  False
2    False   False  False
3     True   False  False

In [11]:
df.company.isna()

0    False
1    False
2    False
3     True
Name: company, dtype: bool

In [12]:
df.loc[df.company.isna()]

  company gender  age
3     NaN   male   28

In [43]:
# any
# 大多数情况下数据量较大，不可能直接isna()后一个一个看是否是缺失值。
# any()和isna()结合使用可以判断某一列是否有缺失值
# df.isna().any()

In [13]:
df.isna().any()

company     True
gender     False
age        False
dtype: bool

In [48]:
# dropna
# 删掉含有缺失值的数据

In [15]:
df.dropna()

  company  gender  age
0       B  female   40
1       A  female   31
2       B    male   28

In [16]:
df

  company  gender  age
0       B  female   40
1       A  female   31
2       B    male   28
3     NaN    male   28

In [53]:
# fillna
# 填充缺失数据 value
# 或 method
  # pad / ffill:      用上一个值填充
  # backfill / bfill: 用下一个值填充

In [23]:
df.fillna(method='pad')

  company  gender  age
0       B  female   40
1       A  female   31
2       B    male   28
3       B    male   28

In [81]:
# sort_values
# 按照某列进行排序（用by参数控制），对Series按数据列进行排序。

In [24]:
df

  company  gender  age
0       B  female   40
1       A  female   31
2       B    male   28
3     NaN    male   28

In [26]:
df.sort_values(by='age',ascending=False)

  company  gender  age
0       B  female   40
1       A  female   31
2       B    male   28
3     NaN    male   28